<template>
  <section>
    <b-table
      :sticky-header="stickyHeader"
      :no-border-collapse="noCollapse"
      responsive
      :items="items"
      :fields="fields"
    >
      <template #head(id)="">
        <div class="text-nowrap">№</div>
      </template>
      <template #head()="scope">
        <div class="text-nowrap">{{ scope.label }}</div>
      </template>
    </b-table>
  </section>
</template>

<script>
export default {
  data() {
    return {
      stickyHeader: true,
      noCollapse: false,
      fields: [
        {
          key: "id",
          stickyColumn: true,
          isRowHeader: true,
          variant: "primary",
        },
        "Локация",
        "Статус",
        "Тип",
        "Описание",
        "Исполнитель",
        "Дата заявки",
        "Дата завершения",
        "Отправитель",
      ],
      items: [
        {
          id: 1,
          Локация: "Квартира",
          Статус: "В ожидании",
          Тип: "Жалоба",
          Описание: "Открыть",
          Исполнитель: "Андрей",
          "Дата заявки": "01.01.2021",
          "Дата завершения": "02.01.2021",
          Отправитель: "Алексей",
        },
        {
          id: 2,
          Локация: "Квартира",
          Статус: "В ожидании",
          Тип: "Жалоба",
          Описание: "Открыть",
          Исполнитель: "Андрей",
          "Дата заявки": "01.01.2021",
          "Дата завершения": "02.01.2021",
          Отправитель: "Алексей",
        },
        {
          id: 3,
          Локация: "Квартира",
          Статус: "В ожидании",
          Тип: "Жалоба",
          Описание: "Открыть",
          Исполнитель: "Андрей",
          "Дата заявки": "01.01.2021",
          "Дата завершения": "02.01.2021",
          Отправитель: "Алексей",
        },
        {
          id: 4,
          Локация: "Квартира",
          Статус: "В ожидании",
          Тип: "Жалоба",
          Описание: "Открыть",
          Исполнитель: "Андрей",
          "Дата заявки": "01.01.2021",
          "Дата завершения": "02.01.2021",
          Отправитель: "Алексей",
        },
        {
          id: 5,
          Локация: "Квартира",
          Статус: "В ожидании",
          Тип: "Жалоба",
          Описание: "Открыть",
          Исполнитель: "Андрей",
          "Дата заявки": "01.01.2021",
          "Дата завершения": "02.01.2021",
          Отправитель: "Алексей",
        },
        {
          id: 6,
          Локация: "Квартира",
          Статус: "В ожидании",
          Тип: "Жалоба",
          Описание: "Открыть",
          Исполнитель: "Андрей",
          "Дата заявки": "01.01.2021",
          "Дата завершения": "02.01.2021",
          Отправитель: "Алексей",
        },
        {
          id: 7,
          Локация: "Квартира",
          Статус: "В ожидании",
          Тип: "Жалоба",
          Описание: "Открыть",
          Исполнитель: "Андрей",
          "Дата заявки": "01.01.2021",
          "Дата завершения": "02.01.2021",
          Отправитель: "Алексей",
        },
      ],
    };
  },
};
</script>
